{
    "Computer": "A device that can receive data, process data according to a set of instructions and produce processed data as a result.",
    "Computer architecture": "How a computer is designed and built to function, including how the parts of the computer are designed, organised and connected.",
    "Data": "Information that is used in a computer. (Singular: Datum).",
    "Bit": "Binary digit which can take on the value of either 0 or 1.",
    "Byte": "Binary number made up of 8 bits.",
    "Processor / Central Processing Unit (CPU)": "Processes data and follows instructions, consists of an arithmetic logic unit and a control unit.",
    "Arithmetic Logic Unit (ALU)": "Part of the processor that processes data by performing basic mathematical and logical operations.",
    "Control Unit": "Part of the processor that follows instructions and decides when and where data should be stored, received or transmitted by different parts of the computer.",
    "Memory": "Stores data, instructions and the results of processing for immediate use.",
    "Volatile (Memory)": "Lost when power supply is interrupted.",
    "Address": "Number that is used to locate a byte in memory.",
    "Secondary storage": "Stores large amounts of data that will not be lost when power supply is interrupted.",
    "Hard Disk (Hard Drive)": "Secondary storage where data is stored on rigid rotating disks coated with a magnetic material.",
    "Bus": "Collection of wires for transporting data from one part of a computer to another part.",
    "Data bus": "Transports data between memory and processor; bi-directional. (2 direction).",
    "Address bus": "Transports required memory location from processor to memory; uni-directional. (1 direction).",
    "Input": "Data or instructions that the computer receives.",
    "Output": "Immediate or final results produced by the computer; usually in the form of processed data.",
    "Execute": "To follow or perform an instruction.",
    "Hardware": "Physical part of a computer.",
    "Software": "Set of instructions to perform specific tasks on a computer.",
    "Input device": "Hardware device that allows users to enter data and instructions into a computer.",
    "Output device": "Hardware device used to display, project or print processed data from a computer.",
    "Magnetic Storage": "Data is stored on magnetic material that can be read or written by a magnetic “head”.",
    "Optical Storage": "Data is stored as very small pits or indentations that can be read or written by a laser.",
    "Solid-state": "Data is stored in electronic circuits called “flash memory” that have no moving parts.",
    "Algorithm": "Set of step-by-step instructions for solving a problem.",
    "Algorithm Input": "Data used by an algorithm that can affect what is required for correct output.",
    "Algorithm Output": "Results produced by an algorithm.",
    "Solution": "Algorithm that always gives correct outputs when provided with valid inputs.",
    "Decomposition": "Breaking down a complex problem or process into smaller and more manageable parts.",
    "Sub-Problem": "A problem whose solution contributes to the solution of a bigger problem.",
    "Pattern recognition": "Identifying similarities among two or more problems.",
    "Generalisation": "Replacing two or more similar problems or solutions with a single, more general problem or solution.",
    "Variable": "Named storage space for a value that can be changed while the algorithm is running.",
    "Constant": "Named storage space for a value that will not be changed while the algorithm is running; an unchanged variable.",
    "Initialise": "To store or assign a value to a variable for the first time.",
    "Dry run": "Process of running through a set of steps manually.",
    "Test data": "Input data that is used to perform a dry run.",
    "Trace table": "Tabulation of the change in variables as well as the output of an algorithm when performing a dry run.",
    "Instruction set": "Set of basic commands or instructions that a processor can understand directly, represented in byte form.",
    "Machine code": "Instructions that can run directly on a computer’s processor.",
    "Program": "A set of instructions written to perform specific tasks on a computer.",
    "Programming language": "Language designed for humans to communicate instructions to computers.",
    "Source code": "Instructions written in a programming language that both humans and computers can understand.",
    "Syntax": "Rules that determine how the words and symbols in a valid instruction are arranged.",
    "Syntax error": "Result of incorrect source code that does not follow the rules of the language.",
    "Compiler": "Code translator program that translates source code into machine code completely before running the compiled program.",
    "Interpreter": "Code translator program that translates source code into machine code while the interpreted program is running.",
    "Identifier (programming)": "Sequence of characters that follows certain rules and can be used as a variable name. (Variables and Constants).",
    "Keyword (programming)": "Word that has a special meaning in a programming language and cannot be used as an identifier.",
    "Naming convention": "A set of generally accepted rules for how identifiers or names should be chosen.",
    "Integer (int)": "Data type representing whole numbers.",
    "Floating-point number (float)": "Data type to represent real numbers that contain a fractional part.",
    "String (str)": "Data type to represent text as a sequence of characters or symbols.",
    "Boolean": "Data type representing either True or False.",
    "List": "Data type for storing multiple values in a sequence.",
    "Literal": "Format for representing a value directly in source code.",
    "Escape code": "Sequence of characters used to input characters that are either difficult to type out as part of a literal or would cause a syntax error if not treated specially. (e.g. \\”).",
    "Type casting": "Process of converting a value from one data type to another.",
    "Function": "A set of instructions assigned to a name that can be used again later.",
    "Function call": "Process of assigning arguments to new variables and running the instructions assigned to a function.",
    "User-Defined function (UDF)": "Function provided by the user of a programming language.",
    "Parameter": "Special variable in a UDF that an argument is assigned to when the UDF is called.",
    "Local variable": "Variable that is created inside a UDF and can only be used in the UDF’s body.",
    "Global variable": "Variable that is created outside of a UDF and is readable from the UDF’s body if its name is not hidden by a local variable.",
    "Data corruption": "When data is made unusable by errors or alterations.",
    "Data loss": "When data is destroyed and cannot be recovered.",
    "Backup": "Copy of data that is made in case the original is damaged or lost.",
    "Uninterruptible power supply (UPS)": "Device that provides enough emergency power for a computer to properly shut down in case of a power failure.",
    "Authentication": "Process of verifying the identity of a user.",
    "Authentication factor": "Category of evidence that is used for authentication.",
    "Unauthorised access": "Situation where data owned by someone is used by someone else without permission.",
    "Security token": "Device used for authentication purposes.",
    "Two-factor authentication": "Type of authentication that uses evidence from both something the user knows and owns.",
    "Biometrics": "Type of authentication based on measurement of physical characteristics.",
    "Identity theft": "Impersonation of another person to steal personal details such as name and identity number for fraudulent purposes.",
    "Privacy policy": "Rules and practices followed by an organisation regarding collection, protection and use of personal and private data provided by users.",
    "Malicious software (Malware)": "Software that is intentionally used to damage, disrupt or gain unauthorised access to a computer system.",
    "Spamming": "Mass distribution off unwanted messages or advertising to email addresses collected from public sources.",
    "Cookie": "A small file used by websites to store personal information on a user’s web browser. Not malicious in nature, sometimes misused to collect personal information about a user.",
    "Phishing": "The use of emails and fake websites that appear to be from reputable companies in order to steal personal information such as passwords and credit card numbers from users.",
    "Pharming": "The interception of requests sent from a computer to a legitimate website and redirection to a fake website to steal personal data of credit card details.",
    "Spyware": "A hidden program that secretly collects personal information about its users and transmits this information to attackers without the users’ knowledge.",
    "Trojan horse": "A computer program that pretends to be a harmless file or useful application, can be used to give intruders unauthorised access.",
    "Virus": "A computer program that attaches itself to a normally harmless program and modifies it, attaching copies of itself to other programs when run, “infecting” them.",
    "Worm": "A computer program that runs automatically and attempts to spread by sending copies of itself to other computers, not need to attach itself to an existing program.",
    "Anti-spyware": "Software to detect, remove and stop spyware and other malware running.",
    "Anti-virus": "Software to detect, remove and stop viruses and other malware running.",
    "Copyright": "The legal right of owners to control the use and distribution of their intellectual property.",
    "Intellectual property": "Creations of the mind that have value but can exist purely as data with no physical form.",
    "License": "Official description of activities authorised or forbidden by the owner of intellectual property.",
    "Free and Open-Source Software (FOSS)": "Software where users are given freedom to change, copy, study and share the software and its source code.",
    "Public domain software": "Software where the legal protections that are typically granted to intellectual property have either expired, been surrendered or simply inapplicable.",
    "Proprietary software": "Commercial software for which most of the legal protections under copyright are retained.",
    "Freeware": "Proprietary software that is available for use at no cost.",
    "Open courseware": "Higher-education course materials such as videos and notes created by universities and distributed for free on the Internet.",
    "Shareware": "Demonstration software that is distributed for free but for a specific evaluation period only.",
    "Copyright infringement": "Use or distribution of copyrighted work without the permission of the copyright owner.",
    "Crack": "Program that modifies proprietary software so that the software cannot detect it is being used illegally.",
    "Software piracy": "Crime of copying, distributing and/or using proprietary software in a manner that is not permitted by its license.",
    "Plagiarism": "Passing off someone else’s original work as your own.",
    "Citation": "Statement to acknowledge and provide credit to author(s) of reproduced material.",
    "Internet Protocol (IP) address": "Sequence of bytes that is used to identify a computer or device on the internet.",
    "Network address": "Unique name or sequence of bytes that is used to identify a computer or device in a network.",
    "Media Access Control (MAC) address": "Sequence of bytes (usually permanent in nature) that is used to identify a particular network interface controller.",
    "Truth table": "Table that shows the resulting output for every possible combination of inputs.",
    "Logic gate": "Electrical circuit that performs logical operations based on one or more inputs and produces a single output.",
    "Logical operation": "An operation that acts on binary inputs to produce an output.",
    "Logic circuit": "A circuit that consists of only one logic gate or multiple logic gates connected together.",
    "Local Area Network (LAN)": "Network of computing devices connected within a small geographical area, typicaly within the same building, such as a home, school or office.",
    "Metropolitan Area Network (MAN)": "Network of computing devices typically spanning across two or more buildings within the same town or city.",
    "Wide Area Network (WAN)": "Network of computing devices covering a large-scale geographical area, typically across multiple geographical locations.",
    "Ethernet": "Most commonly used wired network protocol for local and metropolitan area networks.",
    "Network protocol": "Set of standards and rules that govern how two or more devices communicate over a network.",
    "Wired network": "Network of devices connected by a physical medium, such as cables.",
    "Wireless network": "Network of devices in which signals are transmitted without the use of a physical medium.",
    "Client": "Computer that initiates a connection to a server to request for resources or services to perform operations.",
    "Server": "Computer that shares resources with and responds to request from devices and other servers on the network.",
    "Wireless Access Point (WAP)": "Network hardware that provides a connection between wireless devices up to 100 metres away and can connect to wired networks.",
    "Port number": "Number that is used together with an IP address to uniquely identify a program running on a network.",
    "Service set identifier (SSID)": "A 32-byte string that identifies a wireless access point (WAP) and all devices connected to it. (Wi-Fi name).",
    "Packet": "A unit of broken-up data containing a header with information about the source and destination addresses that are needed for transmission.",
    "Network hub": "Device that transmits received packets to all connected devices.",
    "Network switch": "Device that connects a single network by connecting multiple singular networks together.",
    "Router": "Device that forwards packets between separate networks.",
    "Modulator-Demodulator (Modem)": "Device that modulates and demodulates data.",
    "Modulation": "Conversion of digital data into a form suitable for transmission.",
    "Demodulation": "Conversion of transmitted signals into digital data.",
    "Parity bit": "An additional bit appended to a string of binary data before transmission.",
    "Parity check": "Error-checking technique which uses a parity bit to detect errors.",
    "Checksum": "Calculated value used to determine the integrity of transmitted data."
}